<template>
  <div class="rules">
    <h1 class="rules__title">ПРАВИЛА</h1>
    <p class="rules__text">
      1. Общие положения: 1.1. Начало серии - 09.09.2019; 1.2. Версия игры:
      последняя опубликованная в сервисах Steam, Android или iOS. 1.3.
      Мультиаккаунтинг запрещен. Запрещены любые действия, направленные на
      передачу игрового аккаунта какому-либо третьему лицу. 2. Регистрация на
      турнир: 2.1. Для участия в турнире нужно пройти регистрацию в одной из
      квалификационных игр на сайте турнирной платформы. Регистрация происходит
      при помощи привязки аккаунта Steam. Зайти на сервер дискорд:
      https://discord.gg/kYbYjYs 2.2. Регистрация на участие в турнире
      заканчивается за 2 часа до проведения турнира. 2.3. За 2 часа до начала
      турнира необходимо подтвердить своё участие на сайте турнирной платформы.
      2.4. Запрещено регистрироваться несколько раз под разными никнеймами,
      одному человеку. 3. Формирование участников: 3.1. Минимальное кол-во
      участников квалификации - 32, максимальное - неограниченное; 3.2. Игроки
      обязаны присутствовать на турнире под никнеймами, указанными в заявке
      (никнейм на сервере Discord должен совпадать с никнеймом в Steam). 4.
      Подготовка к турниру: 4.1. Все участники распределяются случайным образом
      в группы по 8 человек. 4.2. С началом турнира на сайте отображается Сетка
      первого раунда, с указанием наименования группы, участниками, количеством
      баллов и комментатором раунда. 5. Формат турнира Shootout (на выбывание):
      5.1. Квалификации: 5.1.1. Каждый игрок в начале квалификации имеет по 6
      баллов (в исключительных случаях смотри п.9.1); 5.1.2. По итогам каждого
      номерного раунда участники могут потерять следующее количество баллов: 8
      место - 6 баллов; 7 место - 6 баллов; 6 место - 3 балла; 5 место - 3
      балла; 4 место - 2 балла; 3 место - 2 балла; 2 место - 1 балл; 1 место - 0
      баллов. 5.1.3. Если кол-во баллов участника становится равным 0 или
      меньше, то участник выбывает из турнира; 5.1.4. В случаях, если к
      последнему и/или предпоследнему раунду игроков остаётся меньше
      необходимому кратному количеству (8/16), то недостающие игроки дополняются
      из тех у кого осталось 0 баллов, но занявших наивысшие позиции в
      предыдущем раунде, начиная со 2 места (если таких игроков несколько
      претендующих на одно место – проходит тот, который имеет больше очков при
      подсчете разницы раундов). 5.1.5. Каждый раунд для каждого участника
      назначается СЛУЧАЙНАЯ восьмерка со СЛУЧАЙНЫМИ соперниками; 5.1.6. В случае
      если до полной восьмёрки не хватает игроков, в игру добавляется бот ранга
      "Нечестный/Пропуск". 5.1.7. Номерные раунды продолжаются до тех пор, пока
      не останется 16 или меньше игроков с положительным кол-вом баллов. 5.1.8.
      После того, как в турнире осталось 16 участников (в исключительных случаях
      смотри п. 5.1.11), назначается предпоследний раунд - всем игрокам
      добавляется 1 дополнительный балл. 5.1.9. По итогам предпоследнего раунда
      участники могут потерять следующее количество баллов: 8 место - 5 баллов;
      7 место - 4 балла; 6 место - 4 балла; 5 место - 3 балла; 4 место - 3
      балла; 3 место - 2 балла; 2 место - 1 балл; 1 место - 0 баллов. 5.1.10. В
      последний раунд в приоритетном порядке проходят все игроки имеющие
      положительное количество баллов (в случаях если количество участников с
      положительным количеством баллов больше 8, предпоследний раунд
      повторяется). 5.1.11. В случаях, если в конце серий раундов осталось 8 или
      меньше участников, турнир сразу переходит к последнему раунду, минуя
      предпоследний раунд, с добавлением недостающих участников в соответствии с
      пунктом 5.1.4. 5.1.12. В последнем раунде определяются призовые места для
      8 участников, всем участникам добавляется 1 балл. 5.1.13. По итогам
      последнего раунда участники могут потерять следующее количество баллов: 8
      место - 7 баллов; 7 место - 6 баллов; 6 место - 5 баллов; 5 место - 4
      балла; 4 место - 3 балла; 3 место - 2 балла; 2 место - 1 балл; 1 место - 0
      баллов. 5.1.14. Призовой фонд квалификации составляет 2000 ₽ и
      распределяется на 8 последних игроков в зависимости от количества
      оставшихся баллов в последнем раунде (в т.ч. отрицательные значения, если
      несколько игроков претендуют на одно место – места распределяются с
      подсчетом разницы раундов в последнем раунде): 1 место 35% от призового
      фонда (700 ₽) 2 место 20% от призового фонда (400 ₽) 3 место 15% от
      призового фонда (300 ₽) 4 место 10% от призового фонда (200 ₽) 5 место 5%
      от призового фонда (100 ₽) 6 место 5% от призового фонда (100 ₽) 7 место
      5% от призового фонда (100 ₽) 8 место 5% от призового фонда (100 ₽)
      5.1.15. Участники занявшие 1-4 места переходят в финальную стадию турнира.
      5.1.16. В случае если один или несколько из участников занявших 1-4 место,
      ранее уже прошли в финальную стадию турнира, то тогда в неё проходят
      участники занявшие 5-8 места в порядке возрастания. 5.2. Финальная стадия
      турнира 5.2.1. Четвертьфинал 5.2.1.1 Каждый игрок в начале четвертьфинала
      имеет по 60 баллов; 5.2.1.2. Игроки играют 3 игры в одной и той же группе.
      По итогам каждой игры участники могут потерять следующее количество
      баллов: 8 место - 20 баллов; 7 место - 18 баллов; 6 место - 16 баллов; 5
      место - 14 баллов; 4 место - 13 баллов; 3 место - 12 баллов; 2 место - 11
      баллов; 1 место - 10 баллов. 5.2.1.3. В Полуфинал проходят 4 игрока из
      каждой группы сохранивших наибольшее количество баллов. 5.2.1.4. Если
      невозможно определить 4 победителей, для ВСЕЙ восьмерки назначается
      дополнительная игра; 5.2.2. Полуфинал 5.2.2.1 Каждый игрок в начале
      полуфинала имеет по 60 баллов; 5.2.2.2. Игроки играют 3 игры в одной и той
      же группе. По итогам каждой игры участники могут потерять следующее
      количество баллов: 8 место - 20 баллов; 7 место - 18 баллов; 6 место - 16
      баллов; 5 место - 14 баллов; 4 место - 13 баллов; 3 место - 12 баллов; 2
      место - 11 баллов; 1 место - 10 баллов. 5.2.2.3. В Финал проходят 4 игрока
      из каждой группы сохранивших наибольшее количество баллов. 5.2.2.4. Если
      невозможно определить 4 победителей, для ВСЕЙ восьмерки назначается
      дополнительный раунд; 5.2.3. ФИНАЛ 5.2.3.1 Каждый игрок в финале имеет по
      100 баллов; 5.2.3.2. Игроки играют 5 игр в одной и той же группе. По
      итогам каждой игры участники могут потерять следующее количество баллов: 8
      место - 20 баллов; 7 место - 18 баллов; 6 место - 16 баллов; 5 место - 14
      баллов; 4 место - 13 баллов; 3 место - 12 баллов; 2 место - 11 баллов; 1
      место - 10 баллов. 5.2.3.3. По итогам серии игр в зависимости от
      количества оставшихся баллов распределяются призовые места. 5.2.3.4. Если
      имеется спор за определенное место, места распределяются с подсчетом
      разницы раундов во всех играх; 5.2.3.5. Призовой фонд финала составляет
      100 000 ₽ и распределяется на 8 финалистов в зависимости от количества
      оставшихся баллов: 1 место 40% от призового фонда (40 000 ₽) 2 место 20%
      от призового фонда (20 000 ₽) 3 место 15% от призового фонда (15 000 ₽) 4
      место 10% от призового фонда (10 000 ₽) 5 место 5% от призового фонда (5
      000 ₽) 6 место 5% от призового фонда (5 000 ₽) 7 место 3% от призового
      фонда (3 000 ₽) 8 место 2% от призового фонда (2 000 ₽) 5.3. Каждый
      последующий раунд начинается после того как сыграют все восьмёрки
      участников раунда; 5.4. Сетка каждого раунда будет обновляться на сайте, а
      также новость об этом будет сообщена в текстовом канале Discord. 5.5. В
      случае неявки или задержки более 10 минут участника на турнир к началу
      каждого раунда ему присуждается техническое поражение и вылет из турнира,
      а сам участник замещается ботом ранга "Нечестный/Пропуск". 6. Подготовка к
      матчу: 6.1. Комментатор который ведёт восьмёрку создаёт лобби и скидывает
      код лобби в соответствующий названию группы текстовый канал Discord. 6.2.
      В случае если у Восьмёрки нет Комментатора, лобби создаёт Бот(или Игрок) и
      скидывает код лобби в соответствующий текстовый канал Discord. 6.3. В
      лобби могут присутствовать лишь игроки, принимающие участие в матче и
      официальный комментатор турнира; 6.4. Запрещено добавлять посторонних
      зрителей; 6.5. Итоговый Скриншот с результатом матча направляется в
      соответствующий названию Восьмёрки текстовый канал Discord участником
      занявшим первое место (или любым другим участником группы). В случае если
      скриншот ни сделал никто – вылетают все участники данной группы. 7.
      Перерывы и паузы: 7.1. Между раундами игроки имеют право на паузу по
      личным обстоятельствам длиной не более 10 минут после объявления сетки
      раунда; 8. Конфликтные и спорные ситуации: 8.1. При общении с
      организаторами администраторами и комментаторами турнира следует соблюдать
      уважительный стиль общения; 8.2. В случае возникновения спорных или
      конфликтных ситуаций необходимо сохранять скриншоты переписки в качестве
      подтверждения для последующего вынесения решения относительно ситуации;
      8.3. Спорной или конфликтной ситуацией может считаться: - Использование
      никнеймов не указанных в заявке; - Попытка обмануть организаторов и
      участников турнира; - Намеренная задержка матча; - Оскорбление участников
      турнира; - Оскорбление комментаторов турнира; - Трансляция матчей без
      разрешения организаторов турнира; - Повторение конфликтных ситуаций.
      Организатор вправе вынести предупреждение или дисквалифицировать
      участников с турнира указав при этом одну из перечисленных причин; 8.4.
      После окончания матча у игроков есть 10 минут на апелляцию результата
      игры. Апелляция принимается только со скриншотами результата матча и в
      противном случае рассматриваться не будет; 8.5. Любое решение
      организаторов относительно спорной/конфликтной ситуации считается
      окончательным и его обсуждение считается нарушением правил даже в том
      случае, если противоречит правилам турнира. 9. Организаторы оставляют за
      собой право изменять и дополнять настоящие правила. 9.1. Организаторы
      оставляют за собой право в исключительных случаях изменять начальное
      значение баллов у участника квалификации, об участниках которые имеют
      право на такое исключение сообщается в новостном канале Discord 10.
      Нажимая на кнопку "Регистрация" на любой из квалификаций турнира участник
      подтверждает что прочитал настоящие Правила и Согласен с его положениями.
    </p>
  </div>
</template>

<script lang="ts">
import Vue from "vue";
export default Vue.extend({
  name: "Rules"
});
</script>

<style lang="scss" scoped>
.rules {
  color: $white;
  text-align: left;
  padding: 30px;
  max-width: 1080px;
  margin: 0 auto;
}
</style>
